microchip-pic-avr-examples/dspic-bootloader-mdfu/dspic33a/crc_uart_1_image/boot.X/mdfu/mdfu_partition_executable.c
/*
Copyright (c) [2025] Microchip Technology Inc.

    All rights reserved.

    You are permitted to use the accompanying software and its derivatives
    with Microchip products. See the Microchip license agreement accompanying
    this software, if any, for additional info regarding your rights and
    obligations.

    MICROCHIP SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT
    WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT
    LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT
    AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP OR ITS
    LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT
    LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER LEGAL EQUITABLE
    THEORY FOR ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES INCLUDING BUT NOT
    LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES,
    OR OTHER SIMILAR COSTS.

    To the fullest extend allowed by law, Microchip and its licensors
    liability will not exceed the amount of fees, if any, that you paid
    directly to Microchip to use this software.

    THIRD PARTY SOFTWARE:  Notwithstanding anything to the contrary, any
    third party software accompanying this software is subject to the terms
    and conditions of the third party's license agreement.  To the extent
    required by third party licenses covering such third party software,
    the terms of such license will apply in lieu of the terms provided in
    this notice or applicable license.  To the extent the terms of such
    third party licenses prohibit any of the restrictions described here,
    such restrictions will not apply to such third party software.
*/

#include <string.h>
#include <stdint.h>

#include "mdfu_partition.h"
#include "mdfu_partition_executable.h"
#include "mdfu_internal_flash.h"
#include "mdfu_config.h"
#include "critical_region.h"
#include "flash_region.h"

/* Included from the ../mcc_generated_files/system project include path */
#include "interrupt.h"

#ifdef __XC__
#include <xc.h>
#endif

#ifndef EXECUTIVE_MEMORY_READ
#define EXECUTIVE_MEMORY_READ(destination, source, length) (void)memcpy(destination, source, length)
#endif

/* Used by the test harness, ignored in production */
#ifndef USER_EXECUTABLE_VALUE
#define USER_EXECUTABLE_VALUE
#endif

#define MAX_COPY_BUFFER_LENGTH MDFU_CONFIG_MAX_COMMAND_DATA_LENGTH

extern const struct FLASH_REGION flashRegion1;

static size_t Read(uint32_t offset, size_t length, void *buffer);
static enum MDFU_PARTITION_STATUS Write(uint32_t address, size_t length, uint8_t const *const data);
static enum MDFU_PARTITION_STATUS Erase(void);
static enum MDFU_PARTITION_STATUS Copy(const struct MDFU_PARTITION *source);
static enum MDFU_PARTITION_STATUS Run(void);
static enum MDFU_PARTITION_STATUS ModeChange(enum MDFU_PARTITION_MODE mode);
static enum MDFU_PARTITION_STATUS Hash(enum MDFU_PARTITION_HASH_ALGORITHM algorithm, uint32_t offset, uint32_t length, uint8_t *digest);
static bool ArgumentsAreInvalid(uint32_t offset, uint32_t length, void const * const pointer);

const struct MDFU_PARTITION executable = {
    .read = &Read,
    .write = &Write,
    .erase = &Erase,
    .copy = &Copy,
    .run = &Run,
    .modeChange = &ModeChange,
    .hash = &Hash};

extern enum MDFU_PARTITION_STATUS EXECUTABLE_ReadWrite(void);
extern enum MDFU_PARTITION_STATUS EXECUTABLE_Executable(void);

/* Hardware specific implementations */
#ifdef __XC__
static inline void IVT_Relocate(void *ivt)
{
    __builtin_setIVTBASE(ivt);
}

static inline void IRT_Disable(void)
{
    IRTCTRLbits.DONE = 1;
}
#endif


/**
 * @brief    Reads the specified memory from the executable partition
 * @param    uint32_t offset - offset into the partition to start reading from
 * @param    size_t length - amount of data to read from partition
 * @param    void* buffer - pointer to where to write the data that is read
 * @return   size_t - the amount of data actually read
 */
static size_t Read(uint32_t offset, size_t length, void *buffer)
{
    /* cppcheck-suppress misra-c2012-11.4
     *
     *  (Rule 11.4) ADVISORY: A conversion should not be performed
     * between a pointer to object and an integer type.
     *
     *  Reasoning: This is required.  The code needs to know the device address
     *  where the partition is located.  Since this is a fixed address and not a
     *  variable, it requires a cast.  The alternative would be to create a
     *  dummy variable at the address of the partition start and point to that
     *  instead.  This alternative would take a custom addressed variable and
     *  corresponding considerations in the linker file.
     */
    const uint8_t *executableStart = (const uint8_t *)MDFU_CONFIG_EXECUTABLE_ORIGIN;

    size_t actualLength = length;

    if (ArgumentsAreInvalid(offset, length, buffer))
    {
        actualLength = 0;
    }
    else
    {
        EXECUTIVE_MEMORY_READ(buffer, &executableStart[offset], actualLength);
    }

    return actualLength;
}

/**
 * @brief    Writes data to the specified address in memory. This is to be called by the client's MDFU Firmware Update Layer when
 *           a write chunk command has been received from the MDFU Command Processor Layer
 * @param    uint32_t offset - offset for the write operation.  Must be aligned to hardware write requirements.
 * @param    size_t length - Number of bytes to be written
 * @param    uint8_t const * const - Pointer to the buffer containing data to be written
 * @return   Status indicating if the write operation was successful and if not, what error occurred
 */
static enum MDFU_PARTITION_STATUS Write(uint32_t offset, size_t length, uint8_t const *const data)
{
    enum MDFU_PARTITION_STATUS status;

    if (ArgumentsAreInvalid(offset, length, data))
    {
        status = MDFU_PARTITION_STATUS_INVALID_ARGUMENT;
    }
    else if (MDFU_INTERNAL_FLASH_Write(MDFU_CONFIG_EXECUTABLE_ORIGIN + offset, length, data))
    {
        status = MDFU_PARTITION_STATUS_SUCCESS;
    }
    else
    {
        status = MDFU_PARTITION_STATUS_OPERATION_FAILED;
    }

    return status;
}

/**
 * @brief    Erases the entire executable partition in preparation for write operations. This is to be called by the client's
 *           MDFU Firmware Update Layer when a start transfer command has been received from the MDFU Command Processor Layer
 * @return   Status indicating if the erase operation was successful
 */
static enum MDFU_PARTITION_STATUS Erase(void)
{
    enum MDFU_PARTITION_STATUS status = MDFU_PARTITION_STATUS_SUCCESS;

    if (MDFU_INTERNAL_FLASH_BlockErase(MDFU_CONFIG_EXECUTABLE_ORIGIN, MDFU_CONFIG_EXECUTABLE_LENGTH) == false)
    {
        status = MDFU_PARTITION_STATUS_OPERATION_FAILED;
    }

    return status;
}

/**
 * @brief    Copy not implemented for single partition bootloading.
 * @return   enum PARTITION_STATUS - Status indicating copy failed and is not implemented for single partition bootloading.
 */
static enum MDFU_PARTITION_STATUS Copy(const struct MDFU_PARTITION *source)
{
    /* Unused parameters */
    (void)source;

    return MDFU_PARTITION_STATUS_OPERATION_FAILED;
}

/**
 * @brief    Run not implemented for this partition.
 * @param    struct MDFU_PARTITION const * const - Pointer to the partition to be copied
 * @return   Status indicating if the copy operation was successful
 */
static enum MDFU_PARTITION_STATUS Run(void)
{
    /*
     * Declare a file-scoped, constant, volatile function pointer named
     * 'user_executable', and a file-scoped, constant, volatile void pointer
     * named 'ivtLocation'. These pointers are set to the program memory (flash)
     * address defined by MDFU_CONFIG_EXECUTABLE_DATA_ORIGIN, which is the entry
     * point of the executable partition, and the location of the executable IVT. 
     * The 'space(prog)' attribute specifies that the pointer refers to program
     * memory (flash), not data memory (RAM).
     * The 'noload' attribute instructs the linker not to initialize this
     * variable at startup.
     * The USER_EXECUTABLE_VALUE attribute is used by the test harness and is not
     * use in production enviornment.
     *
     * By calling 'user_executable()', the bootloader transfers execution to the
     * user application.
     * Accessing 'ivtLocation' you will provide the address of the executable
     * interrupt vector table.
     */
    static void (*volatile const user_executable)(void) __attribute__((address(MDFU_CONFIG_EXECUTABLE_DATA_ORIGIN), space(prog), noload)) USER_EXECUTABLE_VALUE;
    static void *volatile const ivtLocation __attribute__((address(MDFU_CONFIG_EXECUTABLE_DATA_ORIGIN), space(prog), noload)) USER_EXECUTABLE_VALUE;

    /* NOTE: Before starting the executable, all interrupts used
     * by the bootloader must be disabled. Add code here to return
     * the peripherals/interrupts to the reset state before starting
     * the executable code.
     */
#warning "All interrupt sources and peripherals should be disabled before starting the executable. Add any code required here to disable all interrupts and peripherals used in the bootloader."
    INTERRUPT_GlobalDisable();
    INTERRUPT_Deinitialize();

    /* Update the location of the interrupt vector table. */
    IVT_Relocate(ivtLocation);

    /* Disable IRT access before transferring control to the executable.
    *
    * NOTE: The datasheet advises that the IRT should not fetch memory from a non-IRT
    * section before the DONE bit is set. To achieve this, it recommends placing
    * at least a 32-byte buffer between the executable IRT section and any
    * executable non-IRT sections. The keystore, although classified as IRT, is
    * non-executable and thus serves as the recommended buffer. */
    IRT_Disable();

    user_executable();

    /* We should never reach this so report a failure. */
    return MDFU_PARTITION_STATUS_OPERATION_FAILED;
}

/**
 * @brief    Changes the mode of operation of the partition
 * @param    enum MDFU_PARTITION_MODE mode - the mode of operation to set the drive
 *           into.  This is the logical AND of all of the modes required (of type
 *           enum MDFU_PARTITION_MODE).  For example:
 *               ModeChange (MDFU_PARTITION_MODE_READ & MDFU_PARTITION_MODE_WRITE);
 * @return   enum MDFU_PARTITION_STATUS - status of the requested mode change
 */
static enum MDFU_PARTITION_STATUS ModeChange(enum MDFU_PARTITION_MODE mode)
{
    enum MDFU_PARTITION_STATUS status = MDFU_PARTITION_STATUS_MODE_UNSUPPORTED;

    CRITICAL_REGION_Begin();

    if (mode == (enum MDFU_PARTITION_MODE)(MDFU_PARTITION_MODE_READ & MDFU_PARTITION_MODE_WRITE))
    {
        enum FLASH_REGION_PERMISSION permissions = (FLASH_REGION_PERMISSION_READ_ENABLED & FLASH_REGION_PERMISSION_WRITE_ENABLED);
        status = flashRegion1.permissionsSet(permissions, false) ? MDFU_PARTITION_STATUS_SUCCESS : MDFU_PARTITION_STATUS_LOCKED;
    }
    else if (mode == (enum MDFU_PARTITION_MODE)(MDFU_PARTITION_MODE_EXECUTABLE & MDFU_PARTITION_MODE_READ & MDFU_PARTITION_MODE_LOCKED))
    {
        enum FLASH_REGION_PERMISSION permissions = (FLASH_REGION_PERMISSION_EXECUTION_ENABLED & FLASH_REGION_PERMISSION_READ_ENABLED);
        status = flashRegion1.permissionsSet(permissions, true) ? MDFU_PARTITION_STATUS_SUCCESS : MDFU_PARTITION_STATUS_LOCKED;
    }
    else
    {
    }

    CRITICAL_REGION_End();

    return status;
}

/**
 * @brief      Hash not implemented for CRC verification. 
 * @return     enum PARTITION_STATUS - Status indicating hash failed and is not implemented for CRC verification.
 */
static enum MDFU_PARTITION_STATUS Hash(enum MDFU_PARTITION_HASH_ALGORITHM algorithm, uint32_t offset, uint32_t length, uint8_t *digest)
{
    /* Unused parameters */
    (void)algorithm;
    (void)offset;
    (void)length;
    (void)digest;
    
    return MDFU_PARTITION_STATUS_OPERATION_FAILED;
}

/**
 * @brief    Checks if the arguments given for offset length and pointer to data are invalid
 * @param    uint32_t offset - offset into partition should be less than partition length
 * @param    size_t length - Number of bytes should be less than partition length
 * @param    void * pointer - Pointer should be non-null value
 * @return   boolean result of above rules including if values sum to in this partition
 */
static bool ArgumentsAreInvalid(uint32_t offset, uint32_t length, void const * const pointer)
{
    /* This is important to cast/store to a uint32_t for testing to verify any possible
     * roll-over effects of (offset + length) with varying sizes of size_t.
     */
    const uint32_t endOffset = offset + length;

    return  ((NULL == pointer) ||
            (offset >= MDFU_CONFIG_EXECUTABLE_LENGTH) ||
            (length > MDFU_CONFIG_EXECUTABLE_LENGTH) ||
            (endOffset > MDFU_CONFIG_EXECUTABLE_LENGTH));
} 